; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content))
    )
)

; problem
(define (problem problem_size5)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 - location
	box1 box2 box3 box4 box5 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 medicina)
	(at-box box5 deposito)
	(box-has box5 medicina)
	(at-person person1 refugio5)
	(at-person person2 refugio2)
	(at-person person3 refugio5)
	(at-person person4 refugio3)
	(at-person person5 refugio1)
)

(:goal (and
	(person-has person1 comida)
	(person-has person3 medicina)
	(person-has person4 comida)
	(person-has person4 medicina)
	(person-has person5 comida)
))
)

; plan
1. (pick box3 deposito dron1-izq dron1)
   deleted: (at-box box3 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box3)
   goals met: 0 of 5
2. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 0 of 5
3. (leave box3 refugio1 dron1-izq dron1 person5 comida)
   deleted: (carrying dron1 dron1-izq box3)
   added: (at-box box3 refugio1) (free dron1-izq) (person-has person5 comida)
   goals met: 1 of 5
4. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 1 of 5
5. (pick box4 deposito dron1-izq dron1)
   deleted: (at-box box4 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box4)
   goals met: 1 of 5
6. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 1 of 5
7. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 1 of 5
8. (leave box4 refugio5 dron1-izq dron1 person3 medicina)
   deleted: (carrying dron1 dron1-izq box4)
   added: (at-box box4 refugio5) (free dron1-izq) (person-has person3 medicina)
   goals met: 2 of 5
9. (leave box2 refugio5 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box2)
   added: (at-box box2 refugio5) (free dron1-der) (person-has person1 comida)
   goals met: 3 of 5
10. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 3 of 5
11. (pick box5 deposito dron1-izq dron1)
   deleted: (at-box box5 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box5)
   goals met: 3 of 5
12. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 3 of 5
13. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 3 of 5
14. (leave box5 refugio3 dron1-izq dron1 person4 medicina)
   deleted: (carrying dron1 dron1-izq box5)
   added: (at-box box5 refugio3) (free dron1-izq) (person-has person4 medicina)
   goals met: 4 of 5
15. (leave box1 refugio3 dron1-der dron1 person4 comida)
   deleted: (carrying dron1 dron1-der box1)
   added: (at-box box1 refugio3) (free dron1-der) (person-has person4 comida)
   goals met: 5 of 5
